Revit 2026 API

# ParameterValue Properties

---

The ParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ParameterValue Class

Autodesk.Revit.DB Namespace